apojomovsky/pic8-hal/pic16f87xa-hal/src/peripherals/pic16f87xa_timer0.c
/**
 * @file    pic16f87xa_timer0.c
 * @brief   Timer0 driver — implementation (DS39582B §5.0).
 */

#include "peripherals/pic16f87xa_timer0.h"
#include "core/pic16f87xa_interrupt.h"

/* Prescaler ratios — DS39582B Table 5-1.
 *   000 → 1:2
 *   001 → 1:4
 *   ...
 *   111 → 1:256 */
static const uint16_t ps_ratio[8] = { 2, 4, 8, 16, 32, 64, 128, 256 };

/** Per-handle storage. The PIC16F87XA has only one Timer0, so a single
 *  static slot is sufficient. `HAL_TIMER0_Init` writes here; the weak
 *  ISR reads from it. */
static const TIMER0_HandleTypeDef *g_t0_handle = NULL;

/** Read-modify-write helper for OPTION_REG. */
static void option_clr_set(uint8_t clr_mask, uint8_t set_mask)
{
    uint8_t opt = PIC16F87XA_REG8(PIC_REG_OPTION);
    opt = (uint8_t)((opt & (uint8_t)~clr_mask) | set_mask);
    PIC16F87XA_REG8(PIC_REG_OPTION) = opt;
}

PIC16F87XA_StatusTypeDef HAL_TIMER0_Init(const TIMER0_HandleTypeDef *h)
{
    if (!h) return PIC16F87XA_INVALID;

    /* Stop the timer before reconfiguring. */
    PIC16F87XA_BIT_CLR(PIC16F87XA_REG8(PIC_REG_OPTION), PIC_OPTION_T0CS);

    /* Clear TMR0IF; configure TMR0IE if a callback is provided. */
    PIC16F87XA_IRQ_ClearFlag(PIC16F87XA_IRQ_TMR0);
    if (h->OverflowCallback) {
        PIC16F87XA_IRQ_Enable(PIC16F87XA_IRQ_TMR0);
    } else {
        PIC16F87XA_IRQ_DisableSrc(PIC16F87XA_IRQ_TMR0);
    }

    g_t0_handle = h;
    return PIC16F87XA_OK;
}

PIC16F87XA_StatusTypeDef HAL_TIMER0_DeInit(void)
{
    PIC16F87XA_IRQ_DisableSrc(PIC16F87XA_IRQ_TMR0);
    PIC16F87XA_IRQ_ClearFlag(PIC16F87XA_IRQ_TMR0);
    PIC16F87XA_BIT_CLR(PIC16F87XA_REG8(PIC_REG_OPTION), PIC_OPTION_T0CS);
    PIC16F87XA_REG8(PIC_REG_TMR0) = 0x00U;
    return PIC16F87XA_OK;
}

PIC16F87XA_StatusTypeDef HAL_TIMER0_Start(const TIMER0_HandleTypeDef *h)
{
    if (!h) return PIC16F87XA_INVALID;

    /* DS39582B §5.3: writing TMR0 when the prescaler is assigned to
     * Timer0 clears the prescaler. Reload before re-enabling so the
     * first overflow happens after a clean prescaler cycle. */
    PIC16F87XA_REG8(PIC_REG_TMR0) = h->ReloadValue;

    /* Program the prescaler assignment + ratio + clock source + edge
     * in one atomic read-modify-write. */
    uint8_t set_mask = (uint8_t)((h->Prescaler & PIC_OPTION_PS_MASK));
    if (!h->PrescalerAssigned) set_mask |= PIC_OPTION_PSA;
    if (h->ClockSource == TIMER0_CLOCK_EXTERNAL) set_mask |= PIC_OPTION_T0CS;
    if (h->ClockEdge   == TIMER0_EDGE_FALLING)  set_mask |= PIC_OPTION_T0SE;

    /* Clear the bits we are about to write. We do not touch RBPU or
     * INTEDG — those belong to other subsystems. */
    uint8_t clr_mask = (uint8_t)(PIC_OPTION_PS_MASK | PIC_OPTION_PSA |
                                 PIC_OPTION_T0CS  | PIC_OPTION_T0SE);
    option_clr_set(clr_mask, set_mask);

    return PIC16F87XA_OK;
}

PIC16F87XA_StatusTypeDef HAL_TIMER0_Stop(void)
{
    PIC16F87XA_BIT_CLR(PIC16F87XA_REG8(PIC_REG_OPTION), PIC_OPTION_T0CS);
    return PIC16F87XA_OK;
}

uint8_t HAL_TIMER0_ReadCounter(void)
{
    return PIC16F87XA_REG8(PIC_REG_TMR0);
}

void HAL_TIMER0_WriteCounter(uint8_t value)
{
    PIC16F87XA_REG8(PIC_REG_TMR0) = value;
}

uint16_t HAL_TIMER0_PrescalerToRatio(TIMER0_PrescalerTypeDef p)
{
    if ((unsigned)p > 7U) return 1U;
    return ps_ratio[p];
}

/* ------------------------------------------------------------------ */
/* Interrupt entry point                                               */
/* ------------------------------------------------------------------ */

void TIMER0_IRQHandler(void)
{
    if (!PIC16F87XA_IRQ_GetFlag(PIC16F87XA_IRQ_TMR0)) return;
    PIC16F87XA_IRQ_ClearFlag(PIC16F87XA_IRQ_TMR0);
    if (g_t0_handle && g_t0_handle->OverflowCallback) {
        g_t0_handle->OverflowCallback();
    }
}